# **Pandas 14 - Menggabungkan dua Pandas Data Frame**

### Import Modules

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.0
1.24.2

### Persiapan Data Frame

In [3]:
n_rows = 5
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), 
                  columns=cols)
df

    A   B   C   D   E
0  14   9  17   9  12
1   9  13   3   9  18
2   7   8  14  18   5
3  15  15   8   7   8
4  18   3  14  12  15

In [4]:
# Membuat salinan mendalam (deep copy) dari data frame df dan menyimpannya dalam variabel df1
df1 = df.copy(deep=True)

# Menggunakan metode drop untuk menghapus baris dengan indeks 1 dan 4 dari data frame df1
df1 = df1.drop([1, 4])

# Menampilkan data frame df1 setelah penghapusan baris dengan indeks 1 dan 4
df1

    A   B   C   D   E
0  14   9  17   9  12
2   7   8  14  18   5
3  15  15   8   7   8

In [5]:
# Membuat salinan mendalam (deep copy) dari data frame df dan menyimpannya dalam variabel df2
df2 = df.copy(deep=True)

# Menggunakan metode drop untuk menghapus baris dengan indeks 0 dan 3 dari data frame df2
df2 = df2.drop([0, 3])

# Menampilkan data frame df2 setelah penghapusan baris dengan indeks 0 dan 3
df2

    A   B   C   D   E
1   9  13   3   9  18
2   7   8  14  18   5
4  18   3  14  12  15

### Menggabungkan Dua Data Frame

In [6]:
# Menggunakan metode merge dari pandas untuk menggabungkan dua data frame (df1 dan df2) berdasarkan indeks secara inner join
# Parameter how='inner' digunakan untuk menentukan jenis join yang dilakukan, dalam hal ini inner join
df_inner = pd.merge(df1, df2, how='inner')

# Menampilkan hasil penggabungan data frame df1 dan df2 dengan inner join
df_inner

   A  B   C   D  E
0  7  8  14  18  5

In [7]:
# Menggunakan metode merge dari pandas untuk menggabungkan dua data frame (df1 dan df2) berdasarkan indeks secara outer join
# Parameter how='outer' digunakan untuk menentukan jenis join yang dilakukan, dalam hal ini outer join
df_outer = pd.merge(df1, df2, how='outer')

# Menampilkan hasil penggabungan data frame df1 dan df2 dengan outer join
df_outer

    A   B   C   D   E
0   7   8  14  18   5
1   9  13   3   9  18
2  14   9  17   9  12
3  15  15   8   7   8
4  18   3  14  12  15